p2p-bench/results/2026-06-16_5060ti-16gb_2cards_gen3-x4_p2p-sweep-c1-2-4-8/scenarios/p2p_on-c8/run_2.stdout.txt
WARNING 06-16 19:33:58 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7331f83577e0>, trust_remote_code=False, seed=1234, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8081', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='p2p_on-c8', input_len=None, output_len=None, tokenizer='/data/models/qwen3.6-27b-text-nvfp4-mtp', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run1/scenarios/p2p_on-c8', result_filename='run_2.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-f377e2dd-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-16 19:34:03 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  677.59    
Total input tokens:                      131072    
Total generated tokens:                  131072    
Request throughput (req/s):              0.19      
Output token throughput (tok/s):         193.44    
Peak output token throughput (tok/s):    85.00     
Peak concurrent requests:                10.00     
Total token throughput (tok/s):          386.88    
---------------Time to First Token----------------
Mean TTFT (ms):                          16046.23  
Median TTFT (ms):                        16759.65  
P50 TTFT (ms):                           16759.65  
P90 TTFT (ms):                           22563.42  
P99 TTFT (ms):                           26822.28  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.48     
Median TPOT (ms):                        23.50     
P50 TPOT (ms):                           23.50     
P90 TPOT (ms):                           28.66     
P99 TPOT (ms):                           61.97     
---------------Inter-token Latency----------------
Mean ITL (ms):                           70.02     
Median ITL (ms):                         62.39     
P50 ITL (ms):                            62.39     
P90 ITL (ms):                            63.03     
P99 ITL (ms):                            764.06    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          41090.84  
Median E2EL (ms):                        40623.07  
P50 E2EL (ms):                           40623.07  
P90 E2EL (ms):                           50977.02  
P99 E2EL (ms):                           74757.01  
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:19<02:19, 19.93s/it]
 25%|██▌       | 2/8 [00:21<00:54,  9.14s/it]
 38%|███▊      | 3/8 [00:22<00:27,  5.51s/it]
 50%|█████     | 4/8 [00:24<00:15,  3.94s/it]
 62%|██████▎   | 5/8 [00:24<00:07,  2.58s/it]
 75%|███████▌  | 6/8 [00:37<00:12,  6.13s/it]
 88%|████████▊ | 7/8 [00:37<00:04,  4.22s/it]
100%|██████████| 8/8 [00:37<00:00,  2.95s/it]
100%|██████████| 8/8 [00:37<00:00,  4.74s/it]

  0%|          | 0/128 [00:00<?, ?it/s]
  1%|          | 1/128 [00:22<47:06, 22.25s/it]
  2%|▏         | 2/128 [00:26<24:17, 11.56s/it]
  2%|▏         | 3/128 [00:27<14:34,  7.00s/it]
  3%|▎         | 4/128 [00:29<10:10,  4.93s/it]
  4%|▍         | 5/128 [00:30<07:13,  3.52s/it]
  5%|▍         | 6/128 [00:47<16:23,  8.06s/it]
  5%|▌         | 7/128 [00:50<13:01,  6.46s/it]
  6%|▋         | 8/128 [00:51<09:32,  4.77s/it]
  7%|▋         | 9/128 [00:54<07:56,  4.01s/it]
  8%|▊         | 10/128 [00:56<07:06,  3.61s/it]
  9%|▊         | 11/128 [01:08<12:03,  6.19s/it]
  9%|▉         | 12/128 [01:14<11:24,  5.90s/it]
 10%|█         | 13/128 [01:15<08:24,  4.39s/it]
 11%|█         | 14/128 [01:16<06:37,  3.49s/it]
 12%|█▏        | 15/128 [01:22<07:48,  4.15s/it]
 12%|█▎        | 16/128 [01:34<12:09,  6.51s/it]
 14%|█▍        | 18/128 [01:36<07:15,  3.95s/it]
 15%|█▍        | 19/128 [01:38<06:15,  3.45s/it]
 16%|█▌        | 20/128 [01:46<08:23,  4.66s/it]
 16%|█▋        | 21/128 [01:54<10:05,  5.66s/it]
 17%|█▋        | 22/128 [01:58<09:15,  5.24s/it]
 18%|█▊        | 23/128 [02:04<09:39,  5.52s/it]
 19%|█▉        | 24/128 [02:06<07:31,  4.34s/it]
 20%|█▉        | 25/128 [02:15<09:44,  5.68s/it]
 20%|██        | 26/128 [02:16<07:38,  4.49s/it]
 21%|██        | 27/128 [02:26<10:10,  6.04s/it]
 22%|██▏       | 28/128 [02:27<07:35,  4.56s/it]
 23%|██▎       | 29/128 [02:34<08:47,  5.33s/it]
 23%|██▎       | 30/128 [02:35<06:37,  4.05s/it]
 24%|██▍       | 31/128 [02:41<07:23,  4.57s/it]
 25%|██▌       | 32/128 [02:47<07:45,  4.85s/it]
 26%|██▌       | 33/128 [02:53<08:24,  5.31s/it]
 27%|██▋       | 34/128 [03:04<11:05,  7.08s/it]
 27%|██▋       | 35/128 [03:05<08:11,  5.28s/it]
 28%|██▊       | 36/128 [03:16<10:26,  6.81s/it]
 29%|██▉       | 37/128 [03:29<13:19,  8.78s/it]
 30%|██▉       | 38/128 [03:30<09:47,  6.53s/it]
 30%|███       | 39/128 [03:39<10:30,  7.08s/it]
 31%|███▏      | 40/128 [03:40<07:39,  5.23s/it]
 32%|███▏      | 41/128 [03:45<07:45,  5.35s/it]
 33%|███▎      | 42/128 [03:54<09:17,  6.48s/it]
 34%|███▎      | 43/128 [03:57<07:24,  5.22s/it]
 34%|███▍      | 44/128 [04:02<07:19,  5.23s/it]
 35%|███▌      | 45/128 [04:07<06:57,  5.04s/it]
 36%|███▌      | 46/128 [04:11<06:40,  4.88s/it]
 37%|███▋      | 47/128 [04:21<08:33,  6.34s/it]
 38%|███▊      | 48/128 [04:24<07:12,  5.40s/it]
 38%|███▊      | 49/128 [04:28<06:35,  5.00s/it]
 39%|███▉      | 50/128 [04:33<06:26,  4.95s/it]
 40%|███▉      | 51/128 [04:38<06:19,  4.93s/it]
 41%|████      | 52/128 [04:47<08:03,  6.36s/it]
 41%|████▏     | 53/128 [04:48<05:52,  4.70s/it]
 42%|████▏     | 54/128 [04:53<05:46,  4.68s/it]
 43%|████▎     | 55/128 [04:58<05:58,  4.91s/it]
 44%|████▍     | 56/128 [05:01<04:59,  4.16s/it]
 45%|████▍     | 57/128 [05:12<07:19,  6.19s/it]
 45%|████▌     | 58/128 [05:14<05:48,  4.98s/it]
 46%|████▌     | 59/128 [05:20<06:13,  5.42s/it]
 47%|████▋     | 60/128 [05:22<04:55,  4.34s/it]
 48%|████▊     | 61/128 [05:24<03:56,  3.53s/it]
 48%|████▊     | 62/128 [05:38<07:32,  6.86s/it]
 49%|████▉     | 63/128 [05:41<06:00,  5.54s/it]
 50%|█████     | 64/128 [05:43<04:47,  4.50s/it]
 51%|█████     | 65/128 [05:47<04:36,  4.39s/it]
 52%|█████▏    | 66/128 [05:48<03:31,  3.42s/it]
 52%|█████▏    | 67/128 [05:59<05:45,  5.67s/it]
 53%|█████▎    | 68/128 [06:02<04:42,  4.71s/it]
 54%|█████▍    | 69/128 [06:13<06:36,  6.72s/it]
 55%|█████▍    | 70/128 [06:18<06:04,  6.29s/it]
 55%|█████▌    | 71/128 [06:20<04:38,  4.89s/it]
 56%|█████▋    | 72/128 [06:26<04:55,  5.27s/it]
 57%|█████▋    | 73/128 [06:37<06:28,  7.06s/it]
 58%|█████▊    | 74/128 [06:38<04:44,  5.27s/it]
 59%|█████▊    | 75/128 [06:41<03:55,  4.44s/it]
 59%|█████▉    | 76/128 [06:46<04:05,  4.71s/it]
 60%|██████    | 77/128 [06:54<04:40,  5.50s/it]
 61%|██████    | 78/128 [06:58<04:18,  5.17s/it]
 62%|██████▏   | 79/128 [07:04<04:22,  5.35s/it]
 62%|██████▎   | 80/128 [07:10<04:31,  5.65s/it]
 63%|██████▎   | 81/128 [07:13<03:48,  4.86s/it]
 64%|██████▍   | 82/128 [07:23<04:48,  6.28s/it]
 65%|██████▍   | 83/128 [07:27<04:17,  5.73s/it]
 66%|██████▌   | 84/128 [07:37<05:00,  6.84s/it]
 66%|██████▋   | 85/128 [07:37<03:36,  5.04s/it]
 67%|██████▋   | 86/128 [07:42<03:26,  4.92s/it]
 68%|██████▊   | 87/128 [07:43<02:36,  3.82s/it]
 69%|██████▉   | 88/128 [07:57<04:29,  6.73s/it]
 70%|██████▉   | 89/128 [07:58<03:16,  5.03s/it]
 70%|███████   | 90/128 [08:02<03:04,  4.86s/it]
 71%|███████   | 91/128 [08:04<02:19,  3.78s/it]
 72%|███████▏  | 92/128 [08:08<02:20,  3.90s/it]
 73%|███████▎  | 93/128 [08:20<03:43,  6.39s/it]
 73%|███████▎  | 94/128 [08:22<02:47,  4.92s/it]
 74%|███████▍  | 95/128 [08:24<02:15,  4.10s/it]
 75%|███████▌  | 96/128 [08:27<02:03,  3.86s/it]
 76%|███████▌  | 97/128 [08:32<02:08,  4.14s/it]
 77%|███████▋  | 98/128 [08:44<03:14,  6.50s/it]
 77%|███████▋  | 99/128 [08:45<02:23,  4.95s/it]
 78%|███████▊  | 100/128 [08:46<01:46,  3.79s/it]
 79%|███████▉  | 101/128 [08:51<01:47,  4.00s/it]
 80%|███████▉  | 102/128 [09:01<02:31,  5.83s/it]
 80%|████████  | 103/128 [09:10<02:51,  6.88s/it]
 81%|████████▏ | 104/128 [09:13<02:14,  5.59s/it]
 82%|████████▏ | 105/128 [09:17<01:58,  5.14s/it]
 83%|████████▎ | 106/128 [09:18<01:24,  3.85s/it]
 84%|████████▎ | 107/128 [09:23<01:29,  4.27s/it]
 84%|████████▍ | 108/128 [09:35<02:15,  6.76s/it]
 85%|████████▌ | 109/128 [09:41<02:03,  6.50s/it]
 86%|████████▌ | 110/128 [09:44<01:34,  5.26s/it]
 87%|████████▋ | 111/128 [09:46<01:15,  4.46s/it]
 88%|████████▊ | 112/128 [09:55<01:31,  5.69s/it]
 88%|████████▊ | 113/128 [10:01<01:28,  5.88s/it]
 89%|████████▉ | 114/128 [10:06<01:15,  5.42s/it]
 90%|████████▉ | 115/128 [10:07<00:55,  4.28s/it]
 91%|█████████ | 116/128 [10:13<00:55,  4.67s/it]
 91%|█████████▏| 117/128 [10:21<01:01,  5.62s/it]
 92%|█████████▏| 118/128 [10:29<01:03,  6.39s/it]
 93%|█████████▎| 119/128 [10:33<00:51,  5.76s/it]
 94%|█████████▍| 120/128 [10:35<00:35,  4.49s/it]
 95%|█████████▍| 121/128 [10:38<00:28,  4.03s/it]
 95%|█████████▌| 122/128 [10:45<00:31,  5.20s/it]
 96%|█████████▌| 123/128 [10:53<00:30,  6.00s/it]
 97%|█████████▋| 124/128 [10:58<00:22,  5.61s/it]
 98%|█████████▊| 125/128 [10:58<00:11,  4.00s/it]
 98%|█████████▊| 126/128 [11:03<00:08,  4.34s/it]
 99%|█████████▉| 127/128 [11:04<00:03,  3.11s/it]
100%|██████████| 128/128 [11:17<00:00,  6.21s/it]
100%|██████████| 128/128 [11:17<00:00,  5.29s/it]